jrjohn/arcana-embedded-stm32/Tests/test_mqtt.cpp
/**
 * @file test_mqtt.cpp
 * @brief Smoke + AT-sequence coverage for MqttServiceImpl.cpp.
 */
#include <gtest/gtest.h>
#include <cstring>
#include <new>

#include "stm32f1xx_hal.h"
#include "ff.h"
#include "MqttServiceImpl.hpp"
#include "Esp8266.hpp"
#include "SystemClock.hpp"
#include "AtsStorageServiceImpl.hpp"
#include "WifiServiceImpl.hpp"

namespace arcana { namespace mqtt {
struct MqttServiceTestAccess {
    static bool sslConnect(MqttServiceImpl& m) { return m.sslConnect(); }
    static void sslClose(MqttServiceImpl& m) { m.sslClose(); }
    static bool sendPacket(MqttServiceImpl& m, const uint8_t* p, uint16_t l) {
        return m.sendMqttPacket(p, l);
    }
    static bool waitPacket(MqttServiceImpl& m, uint8_t* b, uint16_t& l, uint32_t t) {
        return m.waitMqttPacket(b, l, t);
    }
    static bool handshake(MqttServiceImpl& m) { return m.mqttHandshake(); }
    static bool subscribe(MqttServiceImpl& m, const char* t, uint8_t q = 0) {
        return m.mqttSubscribeRaw(t, q);
    }
    static bool publishRaw(MqttServiceImpl& m, const char* t, const char* p) {
        return m.mqttPublishRaw(t, p);
    }
    static bool publishBin(MqttServiceImpl& m, const char* t, const uint8_t* d, uint16_t len) {
        return m.mqttPublishBin(t, d, len);
    }
    static bool disconnectRaw(MqttServiceImpl& m) { return m.mqttDisconnectRaw(); }
    static bool publishSensor(MqttServiceImpl& m, SensorDataModel* s) {
        return m.publishSensorData(s);
    }
    static void onSensorData(SensorDataModel* m, void* ctx) {
        MqttServiceImpl::onSensorData(m, ctx);
    }
    static void onLightData(arcana::LightDataModel* m, void* ctx) {
        MqttServiceImpl::onLightData(m, ctx);
    }
    static void processIncoming(MqttServiceImpl& m) { m.processIncomingMqtt(); }
    static bool sendFn(const uint8_t* d, uint16_t l, void* ctx) {
        return MqttServiceImpl::mqttSendFn(d, l, ctx);
    }
    static volatile bool& mqttConnected(MqttServiceImpl& m) { return m.mMqttConnected; }
    static volatile bool& sensorPending(MqttServiceImpl& m) { return m.mSensorPending; }
    static SensorDataModel& pendingSensor(MqttServiceImpl& m) { return m.mPendingSensor; }
    static uint16_t& nextPacketId(MqttServiceImpl& m) { return m.mNextPacketId; }
};
}}

using arcana::mqtt::MqttServiceImpl;
using arcana::mqtt::MqttService;
using arcana::mqtt::MqttServiceTestAccess;
using arcana::Esp8266;
using arcana::SystemClock;
using arcana::ServiceStatus;
using arcana::SensorDataModel;
using arcana::atsstorage::AtsStorageServiceImpl;

namespace arcana { namespace atsstorage {
struct AtsStorageTestAccess {
    static bool& dbReady(AtsStorageServiceImpl& s) { return s.mDbReady; }
    static bool& deviceDbReady(AtsStorageServiceImpl& s) { return s.mDeviceDbReady; }
    static ats::ArcanaTsDb& db(AtsStorageServiceImpl& s) { return s.mDb; }
    static ats::ArcanaTsDb& deviceDb(AtsStorageServiceImpl& s) { return s.mDeviceDb; }
    static ats::FatFsFilePort& filePort(AtsStorageServiceImpl& s) { return s.mFilePort; }
    static ats::FatFsFilePort& deviceFilePort(AtsStorageServiceImpl& s) { return s.mDeviceFilePort; }
    static ats::FreeRtosMutex& mutex(AtsStorageServiceImpl& s) { return s.mMutex; }
};
}}
using arcana::atsstorage::AtsStorageTestAccess;

#include "RegistrationServiceImpl.hpp"
namespace arcana { namespace reg {
struct RegistrationServiceTestAccess {
    /** Populate the cached credentials so isRegistered() returns true and
     *  the "registered" branches in MqttServiceImpl::sslConnect /
     *  mqttHandshake exercise the broker / user / pass fields. */
    static void populate(RegistrationServiceImpl& r,
                         const char* broker, uint16_t port,
                         const char* user,   const char* pass) {
        std::strncpy(r.mCreds.mqttBroker, broker, sizeof(r.mCreds.mqttBroker));
        r.mCreds.mqttPort = port;
        std::strncpy(r.mCreds.mqttUser, user, sizeof(r.mCreds.mqttUser));
        std::strncpy(r.mCreds.mqttPass, pass, sizeof(r.mCreds.mqttPass));
        r.mCreds.valid = true;
    }
    static void clear(RegistrationServiceImpl& r) {
        r.mCreds.valid = false;
        r.mCreds.hasCommKey = false;
    }
};
}}
using arcana::reg::RegistrationServiceTestAccess;

namespace {

MqttServiceImpl& mqtt() {
    return static_cast<MqttServiceImpl&>(MqttServiceImpl::getInstance());
}

void resetEnvironment() {
    test_ff_reset();
    SystemClock::getInstance().resetForTest();
    Esp8266::getInstance().resetForTest();

    /* Wire WifiService into MqttService.input — sslConnect derefs it */
    mqtt().input.Wifi = &arcana::wifi::WifiServiceImpl::getInstance();

    /* Reset credentials so each test starts with isRegistered() == false */
    RegistrationServiceTestAccess::clear(
        arcana::reg::RegistrationServiceImpl::getInstance());

    /* Reset AtsStorage singleton state (same trick as test_atsstorage) */
    auto& s = static_cast<AtsStorageServiceImpl&>(
        AtsStorageServiceImpl::getInstance());
    AtsStorageTestAccess::dbReady(s)       = false;
    AtsStorageTestAccess::deviceDbReady(s) = false;
    auto& db    = AtsStorageTestAccess::db(s);
    auto& devDb = AtsStorageTestAccess::deviceDb(s);
    auto& fp    = AtsStorageTestAccess::filePort(s);
    auto& dfp   = AtsStorageTestAccess::deviceFilePort(s);
    auto& mtx   = AtsStorageTestAccess::mutex(s);
    new (&db)    arcana::ats::ArcanaTsDb();
    new (&devDb) arcana::ats::ArcanaTsDb();
    new (&fp)    arcana::ats::FatFsFilePort();
    new (&dfp)   arcana::ats::FatFsFilePort();
    new (&mtx)   arcana::ats::FreeRtosMutex();
}

} // anonymous namespace

// ── Lifecycle smoke ────────────────────────────────────────────────────────

TEST(MqttLifecycle, GetInstanceSingleton) {
    auto& a = MqttServiceImpl::getInstance();
    auto& b = MqttServiceImpl::getInstance();
    EXPECT_EQ(&a, &b);
}

TEST(MqttLifecycle, InitHalReturnsOk) {
    resetEnvironment();
    EXPECT_EQ(mqtt().initHAL(), ServiceStatus::OK);
}

TEST(MqttLifecycle, InitWithoutInputObservablesReturnsOk) {
    resetEnvironment();
    /* No input observables wired → init() takes the no-op branch */
    EXPECT_EQ(mqtt().init(), ServiceStatus::OK);
}

