jrjohn/arcana-embedded-stm32/Tests/test_mqtt.cpp
TEST(MqttHandshake, ConnackRejectedReturnsFalse) {
    resetEnvironment();
    auto& esp = Esp8266::getInstance();
    esp.pushResponse(">"); esp.pushResponse(""); esp.pushResponse("SEND OK");
    /* CONNACK with rc=5 (not authorized) */
    uint8_t bin[11] = {'+','I','P','D',',','4',':', 0x20, 0x02, 0x00, 0x05};
    esp.pushMqttMsg(reinterpret_cast<const char*>(bin), 11);
    EXPECT_FALSE(MqttServiceTestAccess::handshake(mqtt()));
}

TEST(MqttHandshake, SendFailureBails) {
    resetEnvironment();
    auto& esp = Esp8266::getInstance();
    esp.pushResponse("ERROR");   /* CIPSEND fails */
    EXPECT_FALSE(MqttServiceTestAccess::handshake(mqtt()));
}

TEST(MqttHandshake, NoConnackBails) {
    resetEnvironment();
    auto& esp = Esp8266::getInstance();
    esp.pushResponse(">"); esp.pushResponse(""); esp.pushResponse("SEND OK");
    /* No mqtt msg → waitMqttPacket times out → handshake returns false */
    EXPECT_FALSE(MqttServiceTestAccess::handshake(mqtt()));
}

// ── mqttSubscribeRaw with valid SUBACK ─────────────────────────────────────

TEST(MqttSubscribe, HappyPathWithSuback) {
    resetEnvironment();
    auto& esp = Esp8266::getInstance();
    /* sendMqttPacket: CIPSEND > / sendData / SEND OK */
    esp.pushResponse(">"); esp.pushResponse(""); esp.pushResponse("SEND OK");
    /* waitMqttPacket: SUBACK 0x90 0x03 [pktIdH] [pktIdL] [grantedQos]
     * The packet ID is mNextPacketId before increment — set it deterministic */
    MqttServiceTestAccess::nextPacketId(mqtt()) = 0x42;
    uint8_t bin[12] = {'+','I','P','D',',','5',':', (uint8_t)0x90, 0x03, 0x00, 0x42, 0x00};
    esp.pushMqttMsg(reinterpret_cast<const char*>(bin), 12);

    EXPECT_TRUE(MqttServiceTestAccess::subscribe(mqtt(), "topic/sub", 0));
}

TEST(MqttSubscribe, SubackFailureCode0x80) {
    resetEnvironment();
    auto& esp = Esp8266::getInstance();
    esp.pushResponse(">"); esp.pushResponse(""); esp.pushResponse("SEND OK");
    MqttServiceTestAccess::nextPacketId(mqtt()) = 0x10;
    uint8_t bin[12] = {'+','I','P','D',',','5',':', (uint8_t)0x90, 0x03, 0x00, 0x10, (uint8_t)0x80};
    esp.pushMqttMsg(reinterpret_cast<const char*>(bin), 12);
    EXPECT_FALSE(MqttServiceTestAccess::subscribe(mqtt(), "topic", 0));
}

// ── mqttPublishBin with matching PUBACK ────────────────────────────────────

TEST(MqttPublish, BinPubackMatchSucceeds) {
    resetEnvironment();
    auto& esp = Esp8266::getInstance();
    esp.pushResponse(">"); esp.pushResponse(""); esp.pushResponse("SEND OK");
    /* mNextPacketId = 0x55 → publishBin uses 0x55, expects PUBACK with id=0x55 */
    MqttServiceTestAccess::nextPacketId(mqtt()) = 0x55;
    uint8_t bin[11] = {'+','I','P','D',',','4',':', 0x40, 0x02, 0x00, 0x55};
    esp.pushMqttMsg(reinterpret_cast<const char*>(bin), 11);

    const uint8_t data[4] = {1, 2, 3, 4};
    EXPECT_TRUE(MqttServiceTestAccess::publishBin(mqtt(), "topic", data, 4));
}

TEST(MqttPublish, BinPingrespIgnoredAndContinues) {
    /* publishBin's PUBACK loop: if PINGRESP arrives, clear and continue —
     * eventually times out without a PUBACK. */
    resetEnvironment();
    auto& esp = Esp8266::getInstance();
    esp.pushResponse(">"); esp.pushResponse(""); esp.pushResponse("SEND OK");
    MqttServiceTestAccess::nextPacketId(mqtt()) = 0x77;
    uint8_t bin[10] = {'+','I','P','D',',','3',':', (uint8_t)0xD0, 0x00, 0x00};
    esp.pushMqttMsg(reinterpret_cast<const char*>(bin), 10);

    const uint8_t data[2] = {0xAA, 0xBB};
    bool ok = MqttServiceTestAccess::publishBin(mqtt(), "topic", data, 2);
    /* Coverage of the PINGRESP-ignore branch — result depends on subsequent
     * PUBACK availability (which we don't push). */
    (void)ok;
}

TEST(MqttPublish, BinPublishOtherPacketBreaksOut) {
    /* publishBin's PUBACK loop: if a server PUBLISH arrives instead of
     * PUBACK/PINGRESP, break out of the inner loop and continue polling. */
    resetEnvironment();
    auto& esp = Esp8266::getInstance();
    esp.pushResponse(">"); esp.pushResponse(""); esp.pushResponse("SEND OK");
    MqttServiceTestAccess::nextPacketId(mqtt()) = 0x88;
    /* Push a PUBLISH packet (0x30) — not PUBACK, not PINGRESP → break */
    uint8_t bin[14] = {'+','I','P','D',',','7',':',
                       0x30, 0x05, 0x00, 0x01, 't', 'X', 'Y'};
    esp.pushMqttMsg(reinterpret_cast<const char*>(bin), 14);

    const uint8_t data[2] = {0x11, 0x22};
    bool ok = MqttServiceTestAccess::publishBin(mqtt(), "topic", data, 2);
    (void)ok;  /* coverage of the break path */
}

// ── processIncomingMqtt ────────────────────────────────────────────────────

TEST(MqttIncoming, NoIpdReturnsEarly) {
    resetEnvironment();
    auto& esp = Esp8266::getInstance();
    esp.clearMqttMsg();
    /* No mqtt msg → processIncomingMqtt parseIpd fails → return */
    MqttServiceTestAccess::processIncoming(mqtt());
    SUCCEED();
}

TEST(MqttIncoming, PingrespReturnsEarly) {
    resetEnvironment();
    auto& esp = Esp8266::getInstance();
    /* PINGRESP packet 0xD0 0x00 */
    uint8_t bin[9] = {'+','I','P','D',',','2',':', (uint8_t)0xD0, 0x00};
    esp.pushMqttMsg(reinterpret_cast<const char*>(bin), 9);
    MqttServiceTestAccess::processIncoming(mqtt());
    SUCCEED();
}

TEST(MqttIncoming, NonPublishReturnsEarly) {
    resetEnvironment();
    auto& esp = Esp8266::getInstance();
    /* PUBACK packet 0x40 0x02 0x00 0x01 — not a PUBLISH → return */
    uint8_t bin[11] = {'+','I','P','D',',','4',':', 0x40, 0x02, 0x00, 0x01};
    esp.pushMqttMsg(reinterpret_cast<const char*>(bin), 11);
    MqttServiceTestAccess::processIncoming(mqtt());
    SUCCEED();
}

TEST(MqttIncoming, PublishEjectMessageTriggersEject) {
    resetEnvironment();
    auto& esp = Esp8266::getInstance();
    /* PUBLISH QoS 0 to "t" with payload "eject":
     * 0x30 [remLen] [topicLenH=0] [topicLenL=1] 't' 'e' 'j' 'e' 'c' 't'
     * remLen = 2 (topic len) + 1 (topic) + 5 (payload) = 8
     */
    uint8_t bin[18] = {'+','I','P','D',',','1','0',':',
                       0x30, 0x08, 0x00, 0x01, 't', 'e', 'j', 'e', 'c', 't'};
    esp.pushMqttMsg(reinterpret_cast<const char*>(bin), 18);
    MqttServiceTestAccess::processIncoming(mqtt());
    SUCCEED();
}

TEST(MqttIncoming, PublishGenericPayloadForwardsToCommandBridge) {
    resetEnvironment();
    auto& esp = Esp8266::getInstance();
    /* PUBLISH QoS 0 to "t" with binary payload "ABCD" (not "eject") */
    uint8_t bin[17] = {'+','I','P','D',',','9',':',
                       0x30, 0x07, 0x00, 0x01, 't', 'A', 'B', 'C', 'D', 0};
    esp.pushMqttMsg(reinterpret_cast<const char*>(bin), 16);
    MqttServiceTestAccess::processIncoming(mqtt());
    SUCCEED();
}

TEST(MqttIncoming, PublishWithPacketIdSendsPuback) {
    resetEnvironment();
    auto& esp = Esp8266::getInstance();
    /* QoS 1 PUBLISH with packet ID. Need PUBACK to be sent → push response
     * for the CIPSEND. */
    esp.pushResponse(">"); esp.pushResponse(""); esp.pushResponse("SEND OK");
    /* PUBLISH QoS1: 0x32 [remLen] [topicLen:2] [topic] [pktId:2] [payload]
     * remLen = 2 + 1 + 2 + 4 = 9
     */
    uint8_t bin[19] = {'+','I','P','D',',','1','1',':',
                       0x32, 0x09, 0x00, 0x01, 't', 0x12, 0x34, 'A', 'B', 'C', 'D'};
    esp.pushMqttMsg(reinterpret_cast<const char*>(bin), 19);
    MqttServiceTestAccess::processIncoming(mqtt());
    SUCCEED();
}

