jrjohn/arcana-embedded-stm32/Tests/test_mqtt.cpp
// ── mqttSendFn (transport callback) ────────────────────────────────────────

TEST(MqttSendFn, ReturnsFalseWhenDisconnected) {
    resetEnvironment();
    MqttServiceTestAccess::mqttConnected(mqtt()) = false;
    const uint8_t data[4] = {1, 2, 3, 4};
    EXPECT_FALSE(MqttServiceTestAccess::sendFn(data, 4, &mqtt()));
}

TEST(MqttSendFn, HexEncodesAndPublishes) {
    resetEnvironment();
    MqttServiceTestAccess::mqttConnected(mqtt()) = true;
    auto& esp = Esp8266::getInstance();
    /* mqttSendFn → mqttPublishRaw → sendMqttPacket → CIPSEND > / sendData / SEND OK */
    esp.pushResponse(">"); esp.pushResponse(""); esp.pushResponse("SEND OK");
    const uint8_t data[2] = {0xCA, 0xFE};
    /* Result depends on PUBACK match — just verify command was sent */
    MqttServiceTestAccess::sendFn(data, 2, &mqtt());
    EXPECT_GE(esp.sentCmds().size(), 1u);
}

TEST(MqttSendFn, ClampsLongPayload) {
    resetEnvironment();
    MqttServiceTestAccess::mqttConnected(mqtt()) = true;
    auto& esp = Esp8266::getInstance();
    esp.pushResponse(">"); esp.pushResponse(""); esp.pushResponse("SEND OK");
    /* > 64 bytes → clamped to 64 in mqttSendFn */
    uint8_t big[100];
    for (int i = 0; i < 100; ++i) big[i] = (uint8_t)i;
    MqttServiceTestAccess::sendFn(big, 100, &mqtt());
    SUCCEED();
}

// ── Observer callbacks via init() ──────────────────────────────────────────

TEST(MqttObservers, InitWithObservablesSubscribes) {
    resetEnvironment();
    arcana::Observable<SensorDataModel> sensors("s");
    arcana::Observable<arcana::LightDataModel> light("l");
    mqtt().input.SensorData = &sensors;
    mqtt().input.LightData = &light;
    EXPECT_EQ(mqtt().init(), ServiceStatus::OK);
    /* Detach so subsequent tests don't see stale subscriptions */
    mqtt().input.SensorData = nullptr;
    mqtt().input.LightData = nullptr;
}

// ── Registered-credentials branches ─────────────────────────────────────────

TEST(MqttRegistered, SslConnectUsesCredentialBroker) {
    /* When isRegistered() returns true, sslConnect should pull broker/port
     * from the credentials struct (lines 117-119). */
    resetEnvironment();
    auto& reg = arcana::reg::RegistrationServiceImpl::getInstance();
    RegistrationServiceTestAccess::populate(reg, "broker.test.io", 8884,
                                             "u", "p");

    auto& esp = Esp8266::getInstance();
    esp.pushResponse("CONNECT");
    EXPECT_TRUE(MqttServiceTestAccess::sslConnect(mqtt()));

    /* Verify the AT+CIPSTART command went out with the credential broker */
    bool seen = false;
    for (auto& cmd : esp.sentCmds()) {
        if (cmd.find("broker.test.io") != std::string::npos &&
            cmd.find("8884") != std::string::npos) { seen = true; break; }
    }
    EXPECT_TRUE(seen);
}

TEST(MqttRegistered, HandshakeUsesCredentialUserPass) {
    /* mqttHandshake should pull user/pass from credentials when registered
     * (lines 172-174). */
    resetEnvironment();
    auto& reg = arcana::reg::RegistrationServiceImpl::getInstance();
    RegistrationServiceTestAccess::populate(reg, "b", 1883,
                                             "alice", "bobspassword");

    auto& esp = Esp8266::getInstance();
    /* sendMqttPacket: CIPSEND prompt + sendData + SEND OK */
    esp.pushResponse(">");
    esp.pushResponse("");
    esp.pushResponse("SEND OK");
    /* CONNACK wrapped in +IPD frame so parseIpd succeeds */
    char connack[12] = "+IPD,4:";
    connack[7] = (char)0x20; connack[8] = 0x02;
    connack[9] = 0x00;       connack[10] = 0x00;
    esp.pushMqttMsg(connack, 11);

    EXPECT_TRUE(MqttServiceTestAccess::handshake(mqtt()));

    /* The CONNECT packet should embed "alice" + "bobspassword" — the easiest
     * sanity check is that some sentData blob contains those bytes. */
    bool seen = false;
    for (auto& blob : esp.sentData()) {
        std::string s(blob.begin(), blob.end());
        if (s.find("alice") != std::string::npos) { seen = true; break; }
    }
    EXPECT_TRUE(seen);
}

// ── publishBin: parseIpd-fail clearMqttMsg branch (lines 248-249) ───────────

TEST(MqttPublish, PublishBinClearsMalformedIpdAndTimesOut) {
    /* Push an mqtt msg that does NOT parse as a valid +IPD frame so the
     * inner if (parseIpd) is false → falls through to clearMqttMsg + 20ms
     * delay → loop continues until timeout. */
    resetEnvironment();
    MqttServiceTestAccess::nextPacketId(mqtt()) = 1;
    MqttServiceTestAccess::mqttConnected(mqtt()) = true;

    auto& esp = Esp8266::getInstance();
    /* sendMqttPacket: CIPSEND prompt + sendData + SEND OK */
    esp.pushResponse(">");
    esp.pushResponse("");
    esp.pushResponse("SEND OK");
    /* Malformed mqtt msg — no "+IPD," prefix → parseIpd returns false */
    esp.pushMqttMsg("garbage no IPD prefix", 21);

    const uint8_t data[] = {0xAA, 0xBB};
    EXPECT_FALSE(MqttServiceTestAccess::publishBin(mqtt(), "topic", data, 2));
}
